<template>
  <div class="about">
    <h1>Web作品介紹</h1>
    <p>
      此作品為小組共同開發，主要目的為讓屋主(客戶)以及清潔員(工作者)可以互相媒合的一個網站 <br>
      此網站的發想契機像外送平台或是共乘平台可以讓擁有資源或是短期需要此資源的人可以在互換報酬的原則下互惠 <br>
    </p>
    <h2>以下是此網站的介紹影片</h2>
    <div class="video-wrapper">
      <b-embed type="iframe" aspect="16by9" src="https://www.youtube.com/embed/fDdUa-0hfRw"
       ></b-embed>
    </div>
    <p>此網頁的基底為使用node.js去進行傳寫，在此網站裡面可以先選擇兩個身分組(清潔員和屋主)，然後先各自創立自己的帳號 <br>
    創建時會要求輸入個人資料，輸入完後就會到個人的身分組帳號首頁，如果下面有歷史訂單就會顯示在最下方， <br>
    此影片的角度為屋主，當屋主想要請人來進行清潔服務時可以在個人首頁上找到新增需求的按鈕，就可以開始填寫想要清潔的項目和清潔地點等等的資訊 <br>
    請注意:裡面有複數個清潔服務項目，在創建清潔員帳號時就會需要先行選擇自己可以提供哪項服務，只有這項自行選的項目清潔員才看的到要求 <br>
    在屋主成立完後，按下確認，有可以提供此清潔項目服務的清潔員帳號就可以立即的看到最新的屋主需求列表<br>
    清潔員會先看屋主的詳細需求，當清潔員認為可以接下就會在詳細需求的下面開始進行第二階段， <br>
    第二階段為清潔員去屋主家進行清潔服務，當清潔員按下清潔按鈕時就會跳到第三階段，此時清潔員就會開始進行打掃 <br>
    第三階段為當清潔員完成後讓屋主檢查後續最後清潔員按下完成，此時兩個身分組的帳號就會跳回到個人的首頁 <br>
    並且在下方的歷史訂單就會被新增在最新的列表，這樣整體的流程就完成了。
    測測試
    </p>

  </div>
</template>
<style scoped lang="scss">
.video-wrapper {
  max-width: 900px;
  margin: 0 auto;
}

</style>

  